<h1 style="font-size:250%; font-family:cursive; "><b>Pandas Library for Machine Learning-The Absolute basics for beginners - Detailed Video in my YouTube Channel</b><a id="0"></a></h1>


<a href="https://youtu.be/01jGmMEJPHc"><h1 style="font-size:250%; font-family:cursive; color:#ff6666;"><b>Link to this Video Tutorial</b></h1></a>

Series

In [1]:
import pandas as pd

In [2]:
labels = ['a','b','c']
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [3]:
list1 = [1,2,3]
pd.Series(list1)

0    1
1    2
2    3
dtype: int64

In [4]:
dic = {'a':1,'b':2, 'c':3}
pd.Series(data = dic)

a    1
b    2
c    3
dtype: int64

In [5]:
pd.Series(data = list1, index = labels)

a    1
b    2
c    3
dtype: int64

In [6]:
# index
ser1 = pd.Series([1,2,3,4], index = ['USA', 'UAE', "India", "Japan"])
ser1

USA      1
UAE      2
India    3
Japan    4
dtype: int64

In [7]:
ser2 = pd.Series([1,2,5,4], index = ['USA', 'UAE', "Italy", "Japan"])
ser2

USA      1
UAE      2
Italy    5
Japan    4
dtype: int64

In [8]:
ser1['USA']

1

In [9]:
ser1+ser2

India    NaN
Italy    NaN
Japan    8.0
UAE      4.0
USA      2.0
dtype: float64

DataFrames

In [10]:
import numpy as np
from numpy.random import randn
np.random.seed(101)

In [11]:
df = pd.DataFrame(randn(5,4), index = ['A','B','C','D','E'], columns = ['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [13]:
type(df['W'])

pandas.core.series.Series

In [14]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [15]:
# added new col
df['new'] = df['X']+df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [16]:
# drop col
df.drop('new', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [18]:
df.drop('new', axis = 1, inplace = True)

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
# drop one row
df.drop('E', axis = 0, inplace = True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [21]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [22]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [26]:
df.loc['B','Y']

-0.8480769834036315

In [27]:
df.loc[['A','C'],['W','X']]

          W         X
A  2.706850  0.628133
C -2.018168  0.740122

In [28]:
# selection with condition
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [29]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [30]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [31]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [33]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
Name: Y, dtype: float64

In [34]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [35]:
df[(df['W']>0)&(df['Y']>0)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [36]:
# more index
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [37]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [38]:
df['new'] = ['AA','BB','CC','DD']
df

          W         X         Y         Z new
A  2.706850  0.628133  0.907969  0.503826  AA
B  0.651118 -0.319318 -0.848077  0.605965  BB
C -2.018168  0.740122  0.528813 -0.589001  CC
D  0.188695 -0.758872 -0.933237  0.955057  DD

In [39]:
df.set_index('new')

            W         X         Y         Z
new
AA   2.706850  0.628133  0.907969  0.503826
BB   0.651118 -0.319318 -0.848077  0.605965
CC  -2.018168  0.740122  0.528813 -0.589001
DD   0.188695 -0.758872 -0.933237  0.955057

In [40]:
df

          W         X         Y         Z new
A  2.706850  0.628133  0.907969  0.503826  AA
B  0.651118 -0.319318 -0.848077  0.605965  BB
C -2.018168  0.740122  0.528813 -0.589001  CC
D  0.188695 -0.758872 -0.933237  0.955057  DD

In [41]:
df.set_index('new',inplace = True)

In [42]:
df

            W         X         Y         Z
new
AA   2.706850  0.628133  0.907969  0.503826
BB   0.651118 -0.319318 -0.848077  0.605965
CC  -2.018168  0.740122  0.528813 -0.589001
DD   0.188695 -0.758872 -0.933237  0.955057